
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11857321494)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 21 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * module.repositories[&#34;devcontainer-features&#34;].github_repository_file.readme
  * module.repositories[&#34;dyson-rs&#34;].github_repository_file.readme
  * module.repositories[&#34;json-with-comments&#34;].github_branch.default
  * module.repositories[&#34;json-with-comments&#34;].github_branch_default.this
  * module.repositories[&#34;json-with-comments&#34;].github_issue_label.this[&#34;breaking&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_issue_label.this[&#34;bugfix&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_issue_label.this[&#34;deps&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_issue_label.this[&#34;documentation&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_issue_label.this[&#34;feature&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_issue_label.this[&#34;maintenance&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_issue_label.this[&#34;refactor&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository.this
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.readme
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;json-with-comments&#34;].github_repository_pull_request.managed
  * module.repositories[&#34;json-with-comments&#34;].github_repository_ruleset.this
  * module.repositories[&#34;tfgh&#34;].github_repository_file.readme
* Delete
  * module.repositories[&#34;devcontainer-features&#34;].github_branch.managed
  * module.repositories[&#34;dyson-rs&#34;].github_branch.managed
  * module.repositories[&#34;tfgh&#34;].github_branch.managed


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories["devcontainer-features"].github_branch.managed will be destroyed
  # (because github_branch.managed is not in configuration)
  - resource "github_branch" "managed" {
      - branch        = "chore/managed-by-terraform" -> null
      - etag          = "W/\"bb6ac7f64836d0bbea72718b2f790305060d105b8f23ba601dffe2a773881b8f\"" -> null
      - id            = "devcontainer-features:chore/managed-by-terraform" -> null
      - ref           = "refs/heads/chore/managed-by-terraform" -> null
      - repository    = "devcontainer-features" -> null
      - sha           = "ef008ff662524d7143717b6e7e79fa70242394f2" -> null
      - source_branch = "main" -> null
      - source_sha    = "924fb8c42697689134acb3afeede2bf987f6dc54" -> null
    }

  # module.repositories["devcontainer-features"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # devcontainer-features
            devcontainer features
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = false
      + ref                             = (known after apply)
      + repository                      = "devcontainer-features"
      + sha                             = (known after apply)
    }

  # module.repositories["dyson-rs"].github_branch.managed will be destroyed
  # (because github_branch.managed is not in configuration)
  - resource "github_branch" "managed" {
      - branch        = "chore/managed-by-terraform" -> null
      - etag          = "W/\"66559c794144aec6abcd8591fa3844d47102454e3fdf417d7d677d3cab61fab0\"" -> null
      - id            = "dyson-rs:chore/managed-by-terraform" -> null
      - ref           = "refs/heads/chore/managed-by-terraform" -> null
      - repository    = "dyson-rs" -> null
      - sha           = "408c2b4a573d94dc3a835bdcf733db36a6efb497" -> null
      - source_branch = "master" -> null
      - source_sha    = "d94a2b4dc8f49e29b32e8c7e9f43c3b58667fa8e" -> null
    }

  # module.repositories["dyson-rs"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # dyson-rs
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = false
      + ref                             = (known after apply)
      + repository                      = "dyson-rs"
      + sha                             = (known after apply)
    }

  # module.repositories["json-with-comments"].github_branch.default will be created
  + resource "github_branch" "default" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "json-with-comments"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repositories["json-with-comments"].github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "json-with-comments"
    }

  # module.repositories["json-with-comments"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "json-with-comments"
      + url         = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "json-with-comments"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # json-with-comments
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = false
      + ref                             = (known after apply)
      + repository                      = "json-with-comments"
      + sha                             = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Expectation :butterfly:
            > What behavior is expected?
            
            # Reality :bug:
            > How does it actually work?
            
            # Environment :evergreen_tree:
            > (When and) Where the behavior was observed?
            
            # Cause :mag:
            > Why this issue was occurred?
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/issue_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                         = ".github/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            # Overview :rocket:
            > What is this pull request?
            
            # Implementation :clamp:
            > How to realize ?
            
            # Use cases :chopsticks:
            > Why this pull request was created?
            
            # Testing :gear:
            > Testing steps
            
            # Related :chains:
            > The list of related issues or pull requests
            
            # Remark :eyes:
            > Any remarks
        EOT
      + file                         = ".github/pull_request_template.md"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/release.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                         = ".github/release.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "chore/managed-by-terraform"
      + commit_message               = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                   = (known after apply)
      + content                      = <<-EOT
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                         = ".github/workflows/labeler.yml"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "json-with-comments"
      + sha                          = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "master"
      + base_repository       = "json-with-comments"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["json-with-comments"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "json-with-comments"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

  # module.repositories["tfgh"].github_branch.managed will be destroyed
  # (because github_branch.managed is not in configuration)
  - resource "github_branch" "managed" {
      - branch        = "chore/managed-by-terraform" -> null
      - etag          = "W/\"454267554ad6a725f98faa001cc1ec71e0ea1d13b98fd0e641529dd261a9bcef\"" -> null
      - id            = "tfgh:chore/managed-by-terraform" -> null
      - ref           = "refs/heads/chore/managed-by-terraform" -> null
      - repository    = "tfgh" -> null
      - sha           = "ed5d20aed06327c00ddbad9361dd1d503ef36c79" -> null
      - source_branch = "main" -> null
      - source_sha    = "ed5d20aed06327c00ddbad9361dd1d503ef36c79" -> null
    }

  # module.repositories["tfgh"].github_repository_file.readme will be created
  + resource "github_repository_file" "readme" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: README.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # tfgh
            managed by terraform
        EOT
      + file                            = "README.md"
      + id                              = (known after apply)
      + overwrite_on_create             = false
      + ref                             = (known after apply)
      + repository                      = "tfgh"
      + sha                             = (known after apply)
    }

Plan: 21 to add, 0 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"3cde8a8e359cf2d855653406f15bedf132319c52dbd403da679dc7ba434cebda\"" -> "W/\"1e86c68648fdb6e6b1e488f3f774d404c5a00b53a7df8ed0d2f55bd038cd6a79\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"e26cfeabaa904893451d0786f231e72ea78c233735d13c2cbef12f74f6b2f6e0\"" -> "W/\"fd658c725348f26869694fb4b21dacf047379867c74dc98b7214dd105cab0232\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"a13ef11f44665a55383eae81ebcc2d6e03f7ff42ea38621f7a24e7166458d146\"" -> "W/\"56ab0935690b80cc88ff1faac0866d3414dbde2c3cb1c32bb7bf946445f58447\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":66,"Program":"tfcmt","SHA1":"13e18245f47b473036cce8366a085615d8ab2adf","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->